'''https://stepik.org/lesson/265077/step/4?unit=246025

Задача
	Напишите программу, которая выводит на экран текст «Здравствуй, мир!» (без кавычек).
'''
	
print('Здравствуй, мир!')