'''https://stepik.org/lesson/275252/step/6?unit=256355

Задача
    Напишите программу, которая считывает строку-разделитель и три строки, а затем выводит указанные строки через разделитель.

    Формат входных данных
    На вход программе подаётся строка-разделитель и три строки, каждая на отдельной строке.

    Формат выходных данных
    Программа должна вывести введённые три строки через разделитель.
'''
	
sep1 = input()
s1 = input()
s2 = input()
s3 = input()
print(s1, s2, s3, sep=sep1)

