'''https://stepik.org/lesson/265079/step/7?unit=246027

Задача
	Напишите программу, вычисляющую объём куба и площадь его полной поверхности, по введённому значению длины ребра.
'''
	
a = int(input())
print('Объем', a * a * a, sep=' = ')
print('Площадь полной поверхности', 6 * (a * a), sep=' = ')

